package main

import (
	"bufio"
	"bytes"
	"fmt"
	"github.com/wendev/parser/parser"
	"os"
	"strings"
)

/*
1、界符：左右中括号(‘[‘ 、‘]’) ,左右小括号（‘(‘、’)’), 分号（’;’),　空格(‘ ‘)，逗号（‘,’), 大括号(‘{‘、’}’), 双引号（‘ “ ’）。
2、运算符：＋，－， *,  /,  +=, ++， --，  *=,  -=,  /=, ==, &, &&, |, ||, :=
3、数字：所有数字组成的集合。
4、标识符：以下划线或数字为开头，其余由数字，下划线，字母任意组成的集合。
5、关键字：c语言本身定义的常用关键字集合。包括（var, const, func, type, package, struct, interface等等）。
*/
func main() {
	scanner := bufio.NewScanner(os.Stdin)
	fmt.Println(`                                                                                                                               
                                                                                                                               
      $$\  $$$$$$\ $$\    $$\ $$$$$$\           $$$$$$\   $$$$$$\   $$$$$$\   $$$$$$$\  $$$$$$\   $$$$$$\   $$$$$$\   $$$$$$\  
      \__| \____$$\\$$\  $$  |\____$$\         $$  __$$\  \____$$\ $$  __$$\ $$  _____|$$  __$$\ $$  __$$\ $$  __$$\ $$  __$$\ 
      $$\  $$$$$$$ |\$$\$$  / $$$$$$$ |        $$ /  $$ | $$$$$$$ |$$ |  \__|\$$$$$$\  $$$$$$$$ |$$ |  \__|$$ /  $$ |$$ /  $$ |
      $$ |$$  __$$ | \$$$  / $$  __$$ |        $$ |  $$ |$$  __$$ |$$ |       \____$$\ $$   ____|$$ |      $$ |  $$ |$$ |  $$ |
      $$ |\$$$$$$$ |  \$  /  \$$$$$$$ |        $$$$$$$  |\$$$$$$$ |$$ |      $$$$$$$  |\$$$$$$$\ $$ |$$\   \$$$$$$$ |\$$$$$$  |
      $$ | \_______|   \_/    \_______|$$$$$$\ $$  ____/  \_______|\__|      \_______/  \_______|\__|\__|   \____$$ | \______/ 
$$\   $$ |                             \______|$$ |                                                        $$\   $$ |          
\$$$$$$  |                                     $$ |                                                        \$$$$$$  |          
 \______/                                      \__|                                                         \______/           `)
	fmt.Println("Give me some java code, exit with ###")

	var buffer bytes.Buffer
	for scanner.Scan() {
		line := scanner.Text()
		if strings.Contains(line, "###") {
			break
		}
		buffer.WriteString(scanner.Text())
	}

	err := parser.Parse(buffer.String())
	if err != nil {
		fmt.Println(err)
	}

	fmt.Println("Done!")
}
